site/app/views/ourcontests/show.html.erb

    		<% if line.to_s != "\n" %>
		<% @problemedit = Ourproblem.find_by id: line.to_s %>
---
SELECT  "ourproblems".* FROM "ourproblems" WHERE "ourproblems"."id" = ? LIMIT 1  [["id", 19]]