site/app/views/ourcontests/show.html.erb

		<%= line %>
		<% @problemedit = Problem.find_by! name: line.to_s %>
---
SELECT  "problems".* FROM "problems" WHERE "problems"."name" = ? LIMIT 1  [["name", "This is "]]