site/app/views/ourproblems/index.html.erb

SELECT  "ourproblems".* FROM "ourproblems" WHERE "ourproblems"."id" = ? LIMIT 1  [["id", 21]]
---
    		<% if line.to_s != "\n" %>
		<% @problemedit = Ourproblem.find_by id: line.to_s %>