site/app/views/contests/contestadded.html.erb

SELECT  "problems".* FROM "problems" WHERE "problems"."name" = ? LIMIT 1  [["name", "yoo"]]
---
		<%= line %>
		<% @problemedit = Problem.find_by! name: line.to_s %>