site/app/controllers/actions_controller.rb

  def requestsent
   @user = User.find_by username: params[:username]
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "testuser11"]]

  def requestapproved
   @user = User.find_by username: params[:username]
   @user.update_attribute(:admin, true)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "testuser10"]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", "t"], ["updated_at", "2015-04-22 20:56:19.866381"], ["id", 12]]