site/app/controllers/contests_controller.rb

INSERT INTO "contests" ("name", "dateandtime", "duration", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "My First Cook Off"], ["dateandtime", "0012-03-12 00:00:00.000000"], ["duration", 3.0], ["created_at", "2015-03-15 08:09:33.749674"], ["updated_at", "2015-03-15 08:09:33.749674"]]
SELECT  "contests".* FROM "contests" WHERE "contests"."name" = ? LIMIT 1  [["name", "My First Cook Off"]]
INSERT INTO "problems" ("name", "statement", "timelimit", "memory", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "commonMan"], ["statement", "You can do it"], ["timelimit", 4.0], ["memory", 6], ["created_at", "2015-03-15 18:25:35.998924"], ["updated_at", "2015-03-15 18:25:35.998924"]]
SELECT  "problems".* FROM "problems" WHERE "problems"."name" = ? LIMIT 1  [["name", "yoo"]]
---
  def contestadded
   if @@contestexists == 0
	#render plain: params[:contest].inspect
	@contest=Contest.new(contest_params)

	#Save the contest
	@contest.save

	#Retrieve the contest id so that it can be used in the view
	@@contestretrieve = Contest.find_by! name: @contest.name

	#Contest has been added
	@@contestexists += 1

   else
	#Save the problem to the database
	@problem = Problem.new(problem_params)

	#render plain: params[:problem].inspect
	@problem.save!

	#Retrieve the saved problem to get its id
	@problemretrieve = Problem.find_by! name: @problem.name