site/app/controllers/ourcontests_controller.rb

SELECT "ourcontests".* FROM "ourcontests"
---
 def index
 @ourcontests = Ourcontest.all

SELECT  "ourcontests".* FROM "ourcontests" WHERE "ourcontests"."id" = ? LIMIT 1  [["id", 5]]
---
 def edit
   #Admin Layer
 if (current_user.admin? == false)
    redirect_to '/404.html'
   end
  @ourcontest = Ourcontest.find(params[:id])

INSERT INTO "ourcontests" ("name", "start", "end", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Address"], ["start", "2014-05-16 12:00:00.000000"], ["end", "2014-05-17 12:00:00.000000"], ["created_at", "2015-04-03 12:27:33.501732"], ["updated_at", "2015-04-03 12:27:33.501732"]]
---
 def create
  @ourcontest=Ourcontest.new(ourcontest_params)
  if @ourcontest.save

SELECT  "ourcontests".* FROM "ourcontests" WHERE "ourcontests"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "ourcontests" SET "start" = ?, "end" = ?, "updated_at" = ? WHERE "ourcontests"."id" = ?  [["start", "2015-04-22 12:00:00.000000"], ["end", "2015-04-29 12:00:00.000000"], ["updated_at", "2015-04-22 13:41:32.089070"], ["id", 15]]
---
 def update
  @ourcontest = Ourcontest.find(params[:id])

  if @ourcontest.update(ourcontest_params)

SELECT  "ourcontests".* FROM "ourcontests" WHERE "ourcontests"."id" = ? LIMIT 1  [["id", 1]]
---
 def show
  @ourcontest = Ourcontest.find(params[:id])

SELECT  "ourcontests".* FROM "ourcontests" WHERE "ourcontests"."id" = ? LIMIT 1  [["id", 1]]
SELECT "ourproblems".* FROM "ourproblems" WHERE "ourproblems"."contestid" = ?  [["contestid", 8]]
DELETE FROM "ourproblems" WHERE "ourproblems"."id" = ?  [["id", 24]]
DELETE FROM "ourcontests" WHERE "ourcontests"."id" = ?  [["id", 1]]
---
 def destroy
    @ourcontest = Ourcontest.find(params[:id])
    @ourproblems = Ourproblem.all
    #Before deleting the contest, delete the contest problems through a query
    @contestproblems = @ourproblems.where(:contestid => @ourcontest.id)
    @contestproblems.each do |ourproblem|
     	ourproblem.destroy
     end

    #Now,delete the corresponding file in the public folder
    prefix = 'public/problems/problems_list'
    filename = "#{@ourcontest.id}.txt"
    fullname = prefix + filename
    if File.exist?(fullname)
    	File.delete(fullname)
     end
    @ourcontest.destroy

SELECT  "ourcontests".* FROM "ourcontests" WHERE "ourcontests"."id" = ? LIMIT 1  [["id", 12]]
SELECT "ourproblems".* FROM "ourproblems" WHERE "ourproblems"."contestid" = ?  [["contestid", 12]]
---
 def submit
    @ourcontest = Ourcontest.find(params[:ourcontest_id])
    #Check if contest has started
    current = Time.zone.now
	contestBegin = @ourcontest.start
	contestEnd = @ourcontest.end
	contestStarted = contestBegin <= current
	contestNotOver = contestEnd >= current
	if (!contestStarted || !contestNotOver)
		flash[:notice] = "Contest hasn't started yet!"
		redirect_to welcome_main_path
	end
    @ourproblem = Ourproblem.new
    @ourproblems = Ourproblem.all