site/app/controllers/ourproblems_controller.rb

SELECT  "ourcontests".* FROM "ourcontests" WHERE "ourcontests"."id" = ? LIMIT 1  [["id", 5]]
---
 def new
 #Admin Layer
 if (current_user.admin? == false)
    redirect_to '/404.html'
   end
  @id = params[:ourcontest_id]
  #render :text => "Hey #{@id}"
  @ourcontest=Ourcontest.find(params[:ourcontest_id])

SELECT  "ourcontests".* FROM "ourcontests" WHERE "ourcontests"."id" = ? LIMIT 1  [["id", 4]]
---
 def index
 @ourcontest = Ourcontest.find(params[:ourcontest_id])

SELECT  "ourcontests".* FROM "ourcontests" WHERE "ourcontests"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "ourproblems" ("name", "statement", "timelimit", "memory", "code", "contestid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "ourproblems".* FROM "ourproblems" WHERE "ourproblems"."name" = ? LIMIT 1  [["name", "This is "]]
SELECT  "problems".* FROM "problems" WHERE "problems"."name" = ? LIMIT 1  [["name", "Testing The Problem"]]
---
 def create
  @ourcontest=Ourcontest.find(params[:ourcontest_id])
  @ourproblem = Ourproblem.new(ourproblem_params)
  @ourproblem.contestid = params[:ourcontest_id]

  if @ourproblem.save
   	#Retrieve the saved problem to get its id
	@problemretrieve = Ourproblem.find_by! name: @ourproblem.name

SELECT  "ourproblems".* FROM "ourproblems" WHERE "ourproblems"."id" = ? LIMIT 1  [["id", 11]]
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", 18]]
---
 def edit
 #Admin Layer
 if (current_user.admin? == false)
    redirect_to '/404.html'
   end
 @ourproblem = Ourproblem.find(params[:id])

SELECT  "ourproblems".* FROM "ourproblems" WHERE "ourproblems"."id" = ? LIMIT 1  [["id", 18]]
UPDATE "ourproblems" SET "name" = ?, "updated_at" = ? WHERE "ourproblems"."id" = ?  [["name", "hkss"], ["updated_at", "2015-04-10 21:56:36.948306"], ["id", 14]]
---
 def update
  @ourproblem = Ourproblem.find(params[:id])
  if @ourproblem.update(ourproblem_params)

SELECT  "ourcontests".* FROM "ourcontests" WHERE "ourcontests"."id" = ? LIMIT 1  [["id", 11]]
SELECT  "ourproblems".* FROM "ourproblems" WHERE "ourproblems"."id" = ? LIMIT 1  [["id", 12]]
---
 def show
  @ourcontest = Ourcontest.find(params[:ourcontest_id])

  # Evaluating Conditions
  if (current_user.admin? == false)
  	current = Time.zone.now
	contestBegin = @ourcontest.start
	contestEnd = @ourcontest.end
	contestStarted = contestBegin <= current
	contestNotOver = contestEnd >= current
	if (!contestStarted || !contestNotOver)
		flash[:notice] = "Contest hasn't started yet!"
		redirect_to welcome_main_path
	end
  end
  @ourproblem = Ourproblem.find(params[:id])