site/app/controllers/problems_controller.rb

 def edit
 @problemtoedit = Problem.find(params[:id])
---
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = NULL LIMIT 1

 def update
 @problemtoedit = Problem.find(params[:id])
 @problemtoedit.update(problem_params)
---
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "problems" SET "statement" = ?, "updated_at" = ? WHERE "problems"."id" = ?  [["statement", "Tera naam"], ["updated_at", "2015-03-20 13:42:01.130563"], ["id", 16]]