site/app/controllers/welcome_controller.rb

SELECT "contests".* FROM "contests"
SELECT "ourcontests".* FROM "ourcontests"
---
  def main
  @ourcontests = Ourcontest.all